tom38121605/RD_02_mcu_STM32_txt/STM32_01_H7A3_F429_VSCODE/_Awork52_STMH7A3_txt/NUCLEO-F429ZI-AudioRX-FreeRTOS/Src/Boards/Src/NUCLEO-F429ZI/FreeRTOS/usbd_conf.c
#if (USBD_LPM_ENABLED == 1)
/**
  * @brief  HAL_PCDEx_LPM_Callback : Send LPM message to user layer
  * @param  hpcd: PCD handle
  * @param  msg: LPM message
  * @retval HAL status
  */
void HAL_PCDEx_LPM_Callback(PCD_HandleTypeDef *hpcd, PCD_LPM_MsgTypeDef msg)
{
  switch ( msg)
  {
  case PCD_LPM_L0_ACTIVE:
    if (hpcd->Init.low_power_enable)
    {
      SystemClock_Config();
      
      /* Reset SLEEPDEEP bit of Cortex System Control Register */
      SCB->SCR &= (uint32_t)~((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
    }
    __HAL_PCD_UNGATE_PHYCLOCK(hpcd);
    USBD_LL_Resume(hpcd->pData);    
    break;
    
  case PCD_LPM_L1_ACTIVE:
    __HAL_PCD_GATE_PHYCLOCK(hpcd);
    USBD_LL_Suspend(hpcd->pData);
    
    /*Enter in STOP mode */
    if (hpcd->Init.low_power_enable)
    {   
      /* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register */
      SCB->SCR |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
    }     
    break;   
  }
}
#endif
/**
  * @brief  Delays routine for the USB Device Library.
  * @param  Delay: Delay in ms
  * @retval None
  */
void  USBD_LL_Delay (uint32_t Delay)
{
  HAL_Delay(Delay);  
}

/**
  * @brief  static single allocation.
  * @param  size: size of allocated memory
  * @retval None
  */
void *USBD_static_malloc(uint32_t size)
{
#if USE_USB_AUDIO_PLAYBACK || USE_USB_AUDIO_RECORDING
  static uint32_t mem[(sizeof(USBD_AUDIO_HandleTypeDef)/4)+1];/* On 32-bit boundary */
#else
  static uint32_t mem[(sizeof(USBD_CDC_HandleTypeDef)/4)+1];/* On 32-bit boundary */
#endif
  return mem;
}

/**
  * @brief  Dummy memory free
  * @param  *p pointer to allocated  memory address
  * @retval None
  */
void USBD_static_free(void *p)
{

}

#if USE_USB_AUDIO_PLAYBACK || USE_USB_AUDIO_RECORDING
/**
  * @brief  Setup dynamically the fifo.
  * @retval Status OK
  */
static USBD_StatusTypeDef USBD_LL_Setup_Fifo(void)
{

    uint16_t tx_fifo_size[5]   = {0}; /* TX_FIFO allocation*/
    uint8_t max_tx_ep_num      = 0;   /* The Max TX_EP_NUMBER*/
    uint16_t tx_fifo_used_size = 0;   /* total usage of TX_FIFO*/
    uint16_t rx_fifo_size      = 0;   /* total usage of RX_FIFO*/

    /* rx_fifo_size = (5 * number of control endpoints + 8) + ((largest USB packet used / 4) + 1 for status information) +
                    (2 * number of OUT endpoints) + 1 for Global NAK*/
#if USE_USB_AUDIO_PLAYBACK
    rx_fifo_size = (USBD_AUDIO_CONFIG_PLAY_MAX_PACKET_SIZE > 64) ? (USBD_AUDIO_CONFIG_PLAY_MAX_PACKET_SIZE + 3U) / 4 : 16;
#if USE_AUDIO_PLAYBACK_USB_FEEDBACK
    max_tx_ep_num = USB_AUDIO_CONFIG_PLAY_EP_SYNC & 0x7F;
#endif /* USE_AUDIO_PLAYBACK_USB_FEEDBACK */
#else  /* USE_USB_AUDIO_PLAYBACK */
    rx_fifo_size = 16; /*64(mps)/4*/
#endif /* USE_USB_AUDIO_PLAYBACK*/

#if USE_USB_AUDIO_RECORDING
    if ((USB_AUDIO_CONFIG_RECORD_EP_IN & 0x7F) > max_tx_ep_num)
    {
        max_tx_ep_num = USB_AUDIO_CONFIG_RECORD_EP_IN & 0x7F;
    }
    tx_fifo_size[USB_AUDIO_CONFIG_RECORD_EP_IN & 0x7F] = (USBD_AUDIO_CONFIG_RECORD_MAX_PACKET_SIZE + 3U) / 4;
#endif /* USE_USB_AUDIO_RECORDING */

    tx_fifo_used_size = (USB_AUDIO_GetConfigDescriptor(0) + 3) / 4;
    tx_fifo_size[0]   = tx_fifo_used_size;

    for (int i = 1; i <= max_tx_ep_num; i++)
    {
        if (tx_fifo_size[i] < 16)
        {
            tx_fifo_size[i] = 16;
        }
        tx_fifo_used_size += tx_fifo_size[i];
    }

    rx_fifo_size += (5 * 1 /*number of control endpoints*/ + 8
                     + 1 /* for status information*/ + 2 * 6 /*number of OUT endpoints*/ + 1 /*for Global NAK*/);

    if (tx_fifo_used_size + rx_fifo_size <= USB_FIFO_WORD_SIZE)
    {
#if USE_USB_AUDIO_RECORDING
        tx_fifo_size[USB_AUDIO_CONFIG_RECORD_EP_IN & 0x7F] += USB_FIFO_WORD_SIZE - (tx_fifo_used_size + rx_fifo_size);
#else /* USE_USB_AUDIO_RECORDING */
#if USE_USB_AUDIO_PLAYBACK
        rx_fifo_size = USB_FIFO_WORD_SIZE - tx_fifo_used_size;
#endif /* USE_USB_AUDIO_PLAYBACK */
#endif /* USE_USB_AUDIO_RECORDING */
    }
    else
    {
        _Error_Handler(__FILE__, __LINE__);
    }


    HAL_PCDEx_SetRxFiFo(&hpcd_USB_OTG_FS, rx_fifo_size);
    for (int i = 0; i <= max_tx_ep_num; i++)
    {
        HAL_PCD_SetTxFiFo(&hpcd_USB_OTG_FS, i, tx_fifo_size[i]);
    }
    return USBD_OK;
}
#endif
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
